infrastructure/experiments/nginx_ab/source-2/ab_10_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2652 bytes

Concurrency Level:      1
Time taken for tests:   0.161 seconds
Complete requests:      10
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      28878 bytes
HTML transferred:       27058 bytes
Requests per second:    62.16 [#/sec] (mean)
Time per request:       16.086 [ms] (mean)
Time per request:       16.086 [ms] (mean, across all concurrent requests)
Transfer rate:          175.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.1      1       1
Processing:    13   15   1.7     15      18
Waiting:       13   15   1.7     15      18
Total:         14   16   1.8     16      19

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     17
  75%     17
  80%     18
  90%     19
  95%     19
  98%     19
  99%     19
 100%     19 (longest request)
